---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyExportAsGeometry
source: html/6e397bdf-211d-66e4-4c92-7b8e0d03eae6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyExportAsGeometry Property

"Always export as geometry"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyExportAsGeometry { get; }
```